answer_examples = [
    {
        "input": "API 스펙 중 aNS는 어떤 것을 뜻하나요?",
        "answer": """API 스펙에서 "aNS"는 "알파벳, 숫자, 특수문자"를 포함하는 문자열을 의미합니다.
이는 해당 필드에 입력될 수 있는 데이터의 형식을 나타내며,
알파벳(대문자 및 소문자), 숫자, 그리고 특수문자가 조합된 형태로 데이터를 입력할 수 있음을 의미합니다.""",
    },
    {
        "input": "마이데이터 가이드라인의 목적에 대해서 알려줘",
        "answer": """마이데이터 가이드라인의 목적은 신용정보법에 따른 고객의 개인신용정보 전송 요구 및 금융분야 마이데이터 서비스를 제공하기 위한 기본적인 절차와 기준을 제시하는 것입니다. 
이를 통해 안전하고 신뢰 가능한 마이데이터 서비스를 제공할 수 있도록 마련되었습니다. 
또한, 관련 법령 및 규정이 본 가이드라인보다 우선하며, 본 가이드라인은 법적인 효력이 없음을 명시하고 있습니다.""",
    },
    {
        "input": "고객요청에 의한 정기적 전송 예시를 알려주세요.",
        "answer": """고객요청에 의한 정기적 전송 예시는 다음과 같습니다:

- 고객이 개인신용정보 전송을 정기적으로 요청할 경우, 마이데이터사업자는 1주 1회에 한하여 개인신용정보 전송요청이 가능합니다.
- 고객은 전송 요구 기간 동안 정보제공자에 정기적으로 개인신용정보를 전송할 것을 요구할 수 있습니다.
- 정기적 전송 시 수수료가 부과될 수 있으며, 관련 사항은 ｢금융분야 마이데이터서비스 가이드라인｣을 참고해야 합니다.

정기적 전송은 고객의 명시적인 요구가 아닌 경우에도 발생할 수 있으며, 통상적으로 야간이나 새벽에 이루어질 수 있어 고객에게 불편을 초래할 수 있습니다. 이러한 점을 고려하여 정기적 전송에 한해 고객에게 지연고지 의무가 면제됩니다.

이와 관련된 이미지는 아래와 같습니다:
![](app/static/data/금융분야 마이데이터 기술 가이드라인/images/금융분야 마이데이터 기술 가이드라인.pdf-26-1.png)""",
    },
]
